Repository: jerojasro/django-doc-es
Catalog: */po/tutorial04.po
Languages: es

source: Writing your first Django app, part 4 =====================================
es: Su primera aplicación en Django, parte 4 ========================================

source: This tutorial begins where :doc:`Tutorial 3 </intro/tutorial03>` left off. We're continuing the Web-poll application and will focus on simple form processing and cutting down our code.
es: Este tutorial comienza en el punto en el que terminó el :doc:`Tutorial 3 </intro/tutorial03>`. Continuamos nuestra aplicación de votaciones y nos enfocaremos en procesar formularios y aligerar nuestro código.

source: Write a simple form ===================
es: Crear un formulario sencillo ============================

source: Let's update our poll detail template ("polls/detail.html") from the last tutorial, so that the template contains an HTML ``<form>`` element:
es: Actualicemos nuestra plantilla detalle ("polls/detail.html") del tutorial anterior, para que contenga un elemento HTML ``<form>``:

source: A quick rundown:
es: una explicación rápida:

source: The above template displays a radio button for each poll choice. The ``value`` of each radio button is the associated poll choice's ID. The ``name`` of each radio button is ``"choice"``. That means, when somebody selects one of the radio buttons and submits the form, it'll send the POST data ``choice=3``. This is HTML Forms 101.
es: La plantilla anterior muestra un botón de radio para cada elección de la encuesta. El ``valor`` de cada botón de radio está asociado al ID de una opción. El ``ǹombre`` de cada botón de radio es ``"choice"``. Esto significa que cuando alguien selecciona uno de los botones de radio y envía el formulario, enviará el dato POST ``choice=3``. Esto es formularios HTML 101.

source: We set the form's ``action`` to ``/polls/{{ poll.id }}/vote/``, and we set ``method="post"``. Using ``method="post"`` (as opposed to ``method="get"``) is very important, because the act of submitting this form will alter data server-side. Whenever you create a form that alters data server-side, use ``method="post"``. This tip isn't specific to Django; it's just good Web development practice.
es: Establecemos el ``action`` del formulario a ``/polls{{ poll.id }}/vote/``, y establecemos ``method="post"``. Usar ``method="post"`` (en lugar de ``method="get"``) es muy importante, porque el acto de enviar este formulario modificará los datos en el lado del servidor. Cada vez que cree un formulario que altere los datos en el lado del servidor, use ``method="post"``. Este consejo no es específico para Django; es solamente una buena práctica de desarrollo web.

source: ``forloop.counter`` indicates how many times the :ttag:`for` tag has gone through its loop
es: ``forloop.counter`` indica cuántas veces la etiqueta :ttag:`for` ha pasado por el bucle

source: Since we're creating a POST form (which can have the effect of modifying data), we need to worry about Cross Site Request Forgeries. Thankfully, you don't have to worry too hard, because Django comes with a very easy-to-use system for protecting against it. In short, all POST forms that are targeted at internal URLs should use the :ttag:`{% csrf_token %}<csrf_token>` template tag.
es: Dado que estamos creando un formulario POST (que puede tener el efecto de modificar datos), necesitamos tener en cuenta las falsificaciones de terceros(CSRF). Afortunadamente no tiene que preocuparse demasiado, porque Django viene con un sistema muy sencillo para protgerse de las mismas. Resumiendo, todos los formularios POST que tengan como desinto URLs internas deberían usar la etiqueta de plantilla :ttag:`{% csrf_token %}<csrf_token>`.

source: The :ttag:`{% csrf_token %}<csrf_token>` tag requires information from the request object, which is not normally accessible from within the template context. To fix this, a small adjustment needs to be made to the ``detail`` view, so that it looks like the following::
es: La etiqueta :ttag:`{% csrf_token %}<csrf_token>` requiere información del objeto solicitud, al cual no se puede acceder normalmente desde el contexto de la plantilla. Para arreglarlo, basta un pequeño ajuste a la vista ``detalle``, para que luzca de la siguiente forma::

source: The details of how this works are explained in the documentation for :ref:`RequestContext <subclassing-context-requestcontext>`.
es: Los detalles de cómo funciona esto se explican en la documentación :ref:`RequestContext <subclassing-context-requestcontext>`.

source: Now, let's create a Django view that handles the submitted data and does something with it. Remember, in :doc:`Tutorial 3 </intro/tutorial03>`, we created a URLconf for the polls application that includes this line::
es: Ahora creemos la vista de Django que se encarga de los datos enviados y hace algo con estos. Recuerde que en el :doc:`Tutorial 3 </intro/tutorial03>` creamos un URLconf para la aplicación de encuestas que incluía esta línea::

source: We also created a dummy implementation of the ``vote()`` function. Let's create a real version. Add the following to ``polls/views.py``::
es: También creamos una implementación inocua de la función ``vote()``. Ahora creemos una versión real. Añada lo siguiente a ``polls/views.py``::

source: from django.shortcuts import get_object_or_404, render_to_response from django.http import HttpResponseRedirect, HttpResponse from django.core.urlresolvers import reverse from django.template import RequestContext from polls.models import Choice, Poll # ... def vote(request, poll_id): p = get_object_or_404(Poll, pk=poll_id) try: selected_choice = p.choice_set.get(pk=request.POST['choice']) except (KeyError, Choice.DoesNotExist): # Redisplay the poll voting form. return render_to_response('polls/detail.html', { 'poll': p, 'error_message': "You didn't select a choice.", }, context_instance=RequestContext(request)) else: selected_choice.votes += 1 selected_choice.save() # Always return an HttpResponseRedirect after successfully dealing # with POST data. This prevents data from being posted twice if a # user hits the Back button. return HttpResponseRedirect(reverse('polls.views.results', args=(p.id,)))
es: from django.shortcuts import get_object_or_404, render_to_response from django.http import HttpResponseRedirect, HttpResponse from django.core.urlresolvers import reverse from django.template import RequestContext from polls.models import Choice, Poll # ... def vote(request, poll_id): p = get_object_or_404(Poll, pk=poll_id) try: selected_choice = p.choice_set.get(pk=request.POST['choice']) except (KeyError, Choice.DoesNotExist): # mostrar de nuevo el formulario de votación. return render_to_response('polls/detail.html', { 'poll': p, 'error_message': "No eligió una opción.", }, context_instance=RequestContext(request)) else: selected_choice.votes += 1 selected_choice.save() # Siempre retorne un HttpResponseRedirect después de tratar un # POST de datos exitoso. Esto impide que se añada dos veces # Si se oprime el botón atrás del navegador. return HttpResponseRedirect(reverse('polls.views.results', args=(p.id,)))

source: This code includes a few things we haven't covered yet in this tutorial:
es: El código visto incluye algunas cosas que no hemos cubierto todavía en este tutorial:

source: :attr:`request.POST <django.http.HttpRequest.POST>` is a dictionary-like object that lets you access submitted data by key name. In this case, ``request.POST['choice']`` returns the ID of the selected choice, as a string. :attr:`request.POST <django.http.HttpRequest.POST>` values are always strings.
es: :attr:`request.POST <django.http.HttpRequest.POST>` es un objeto parecido a un diccionario que le permite acceder a sus datos por llaves. En este caso, ``request.POST['choice']`` retorna el ID de la opción elegida como una cadena. Los valores de :attr:`request.POST <django.http.HttpRequest.POST>` siempres son cadenas.

source: Note that Django also provides :attr:`request.GET <django.http.HttpRequest.GET>` for accessing GET data in the same way -- but we're explicitly using :attr:`request.POST <django.http.HttpRequest.POST>` in our code, to ensure that data is only altered via a POST call.
es: Tenga en cuenta que Django también provee :attr:`request.GET <django.http.HttpRequest.GET>` para acceder a los datos GET de la misma forma -- pero estamos usando :attr:`request.POST <django.http.HttpRequest.POST>` en nuestro código explícitamente para asegurarnos de obtener únicamente los datos POST.

source: ``request.POST['choice']`` will raise :exc:`KeyError` if ``choice`` wasn't provided in POST data. The above code checks for :exc:`KeyError` and redisplays the poll form with an error message if ``choice`` isn't given.
es: ``request.POST['choice']`` generará una :exc:`KeyError` si ``choice`` no hace parte de POST. El código anterior revisa :exc:`KeyError` y vuelve a mostrar el formulario de encuesta con un mensaje de error si no se encontró ``choice``.

source: After incrementing the choice count, the code returns an :class:`~django.http.HttpResponseRedirect` rather than a normal :class:`~django.http.HttpResponse`. :class:`~django.http.HttpResponseRedirect` takes a single argument: the URL to which the user will be redirected (see the following point for how we construct the URL in this case).
es: Después de incrementar el contador choice, el código retorna un :class:`~django.http.HttpResponseRedirect` en lugar del ya conocido :class:`~django.http.HttpResponse`.:class:`~django.http.HttpResponseRedirect` toma como único argumento: el URL al cual el usuario será redirigido ( Vea en el punto siguiente la forma como construimos el URL para este caso).

source: As the Python comment above points out, you should always return an :class:`~django.http.HttpResponseRedirect` after successfully dealing with POST data. This tip isn't specific to Django; it's just good Web development practice.
es: Como el comentario de Python anterior sugirió, siempre debemos retornar un :class:`~django.http.HttpResponseRedirect` después de haber tratado exitósamente con datos POST. Este consejo no es específico para Django; es simplemente una buena práctica de desarrollo web.

source: We are using the :func:`~django.core.urlresolvers.reverse` function in the :class:`~django.http.HttpResponseRedirect` constructor in this example. This function helps avoid having to hardcode a URL in the view function. It is given the name of the view that we want to pass control to and the variable portion of the URL pattern that points to that view. In this case, using the URLconf we set up in Tutorial 3, this :func:`~django.core.urlresolvers.reverse` call will return a string like ::
es: En este ejemplo estamos usando la función :func:`~django.core.urlresolvers.reverse` con el constructor :class:`~django.http.HttpResponseRedirect`. Esta función ayuda a evitar "quemar" una URL en la función de la vista. Lo que pasamos es el nombre de la vista a la que deseamos darle el control y la porción variable del patrón de la URL que apunta a tal vista. En este caso, al usar el URLconf que establecimos en el Tutorial 3, la llamada a :func:`~django.core.urlresolvers.reverse` retornará una cadena como ::

source: ... where the ``3`` is the value of ``p.id``. This redirected URL will then call the ``'results'`` view to display the final page. Note that you need to use the full name of the view here (including the prefix).
es: ... donde el ``3`` es el valor de ``p.id``. Este URL redirigido llamará la vista ``'results'`` que mostrará la página finalmente. Tenga en cuenta que debe usar el nombre completo de la vista(incluyendo el prefijo).

source: As mentioned in Tutorial 3, ``request`` is a :class:`~django.http.HttpRequest` object. For more on :class:`~django.http.HttpRequest` objects, see the :doc:`request and response documentation </ref/request-response>`.
es: Como se mencionó en el Tutorial 3, ``request`` es un objeto :class:`~django.http.HttpRequest`. Para daber más acerca del objeto :class:`~django.http.HttpRequest`, ver :doc:`request y la documentación de response </ref/request-response>`.

source: After somebody votes in a poll, the ``vote()`` view redirects to the results page for the poll. Let's write that view::
es: Después de que alguien diligencia una encuesta, la vista ``vote()`` redirige la página de resultados de la encuesta. Escribamos tal vista::

source: This is almost exactly the same as the ``detail()`` view from :doc:`Tutorial 3 </intro/tutorial03>`. The only difference is the template name. We'll fix this redundancy later.
es: Esta es casi la misma vista ``detail()`` del :doc:`Tutorial 3 </intro/tutorial03>`. La única diferencia es el nombre de la plantilla. Arreglamos esta redundancia posteriormente.

source: Now, create a ``results.html`` template:
es: Ahora creamos la plantilla ``results.html``:

source: <a href="/polls/{{ poll.id }}/">Vote again?</a>
es: <a href="/polls/{{ poll.id }}/">Votar de nuevo?</a>

source: Now, go to ``/polls/1/`` in your browser and vote in the poll. You should see a results page that gets updated each time you vote. If you submit the form without having chosen a choice, you should see the error message.
es: Ahora vaya a ``/polls/1/`` con su navegador y vote la encuesta. Debería ver la página de resultados actualizada cada vez que vota. Si envía el formulario sin elegir opción, verá el mensaje de error.

source: Use generic views: Less code is better ======================================
es: Use vistas genéricas: Menos código es mejor ======================================

source: The ``detail()`` (from :doc:`Tutorial 3 </intro/tutorial03>`) and ``results()`` views are stupidly simple -- and, as mentioned above, redundant. The ``index()`` view (also from Tutorial 3), which displays a list of polls, is similar.
es: El ``detail()`` (del :doc:`Tutorial 3 </intro/tutorial03>`) y la vista ``results()`` son increíblemente sencillos -- y, como se mencionó anteiormente, redundantes. La vista ``index()`` (también del Tutorial 3), que despliega la lista de encuestas, es similar.

source: These views represent a common case of basic Web development: getting data from the database according to a parameter passed in the URL, loading a template and returning the rendered template. Because this is so common, Django provides a shortcut, called the "generic views" system.
es: Estas vistas representan un caso común en desarrollo web básico: obtener información de la base de datos de acuerdo a un parámetro pasado en la URL, cargar la plantilla y retornar la visualización. Dado que es tan común, Django provee un atajo, llamado el sistema de "vistas genéricas".

source: Generic views abstract common patterns to the point where you don't even need to write Python code to write an app.
es: Las vistas genéricas abstraen patrones comunes a tal punto que no se requiere escribir código Python para escribir una aplicación.

source: Let's convert our poll app to use the generic views system, so we can delete a bunch of our own code. We'll just have to take a few steps to make the conversion. We will:
es: Convirtamos nuestra aplicación de votaciones al sistema de vistas genéricas, de forma tal que podamos borrar mucho de nuestro propio código. Solamente tenemos que dar unos pasos para hacer esta conversión. Vamos a:

source: Convert the URLconf.
es: Convertir el URLconf.

source: Delete some of the old, unneeded views.
es: Borrar algunas de las antiguas e innecesarias vistas.

source: Fix up URL handling for the new views.
es: Arreglar los URL que se encargan de las nuevas vistas.

source: Read on for details.
es: Siga leyendo los detalles.

source: .. admonition:: Why the code-shuffle?
es: .. advertencia:: Por qué la reescritura de código?

source: Generally, when writing a Django app, you'll evaluate whether generic views are a good fit for your problem, and you'll use them from the beginning, rather than refactoring your code halfway through. But this tutorial intentionally has focused on writing the views "the hard way" until now, to focus on core concepts.
es: Generalmente, cuando escriba una aplicación de Django, va a evaluar si usar vistas genéricas es bueno para su problema, y las usará desde el principio, en lugar de refactorizar su código a mitad del camino. Pero este tutorial se ha enfocado intencionalmente en escribir las vistas de la "forma difícil" hasta ahora, para enfocarnos en los conceptos centrales.

source: You should know basic math before you start using a calculator.
es: Uno debería saber matemáticas básicas antes de comenzar a usar la calculadora.

source: First, open the ``polls/urls.py`` URLconf. It looks like this, according to the tutorial so far::
es: Primero, abra el URLconf ``polls/urls.py``. Luce de la siguiente forma, de acuerdo al tutorial hasta ahora::

source: Change it like so::
es: Cámbielo para que luzca así::

source: We're using two generic views here: :class:`~django.views.generic.list.ListView` and :class:`~django.views.generic.detail.DetailView`. Respectively, those two views abstract the concepts of "display a list of objects" and "display a detail page for a particular type of object."
es: Estamos usando dos vistas genéricas aquí: :class:`~django.views.generic.list.ListView` y :class:`~django.views.generic.detail.DetailView` ambas vistas abstraen los conceptos de "mostrar una lista de objetos" y "desplegar la página de detalle para un tipo particular de objeto."

source: Each generic view needs to know what model it will be acting upon. This is provided using the ``model`` parameter.
es: Cada vista genérica necesita saber sobre qué modelo estará actuando. Esto se logra usando el parámetro ``modelo``

source: The :class:`~django.views.generic.list.DetailView` generic view expects the primary key value captured from the URL to be called ``"pk"``, so we've changed ``poll_id`` to ``pk`` for the generic views.
es: La vista genérica :class:`~django.views.generic.list.DetailView` espera el valor de la llave primaria capturado en la URL que se llamará ``"pk"``, y que hemos cambiado de ``poll_id`` a ``pk`` para la vista genérica.

source: We've added a name, ``poll_results``, to the results view so that we have a way to refer to its URL later on (see the documentation about :ref:`naming URL patterns <naming-url-patterns>` for information). We're also using the :func:`~django.conf.urls.url` function from :mod:`django.conf.urls` here. It's a good habit to use :func:`~django.conf.urls.url` when you are providing a pattern name like this.
es: Adicionamos el nombre ``poll_results`` a la lista de resultados de forma que tengamos una manera de referirnos a su URL posteriormente (ver la documentación acerca de :ref:`nombramiento de patrones URL <naming-url-patterns>`). También estamos usando la función :func:`~django.conf.urls.url` de :mod:`django.conf.urls` aquí. Es un buen hábito usar :func:`~django.conf.urls.url` cuando provee un nombre de patrón como este.

source: By default, the :class:`~django.views.generic.list.DetailView` generic view uses a template called ``<app name>/<model name>_detail.html``. In our case, it'll use the template ``"polls/poll_detail.html"``. The ``template_name`` argument is used to tell Django to use a specific template name instead of the autogenerated default template name. We also specify the ``template_name`` for the ``results`` list view -- this ensures that the results view and the detail view have a different appearance when rendered, even though they're both a :class:`~django.views.generic.list.DetailView` behind the scenes.
es: De forma predeterminada, la vista genérica :class:`~django.views.generic.list.DetailView` usa una plantilla llamada ``<app name>/<model name>_detail.html``. En nuestro caso, usaremosla plantilla ``"polls/poll_detail.html"``. Empleamos el argumento ``template_name`` para decirle a Django que use una plantilla específica en lugar del nombre de plantilla autogenerado. También especificamos el ``template_name`` para la vista ``results`` que actúa como listado -- esto asegura que la vista de resultados y la vista de detalle tienen una apariencia distinta cuando se visualizan, a pesar de ambas ser :class:`~django.views.generic.list.DetailView` tras bambalinas.

source: Similarly, the :class:`~django.views.generic.list.ListView` generic view uses a default template called ``<app name>/<model name>_list.html``; we use ``template_name`` to tell :class:`~django.views.generic.list.ListView` to use our existing ``"polls/index.html"`` template.
es: De forma similar ls vista genérica :class:`~django.views.generic.list.ListView` usa una plantilla predeterminada llamada ``<app name>/<model name>_list.html``; usamos ``template_name`` para decirle a :class:`~django.views.generic.list.ListView` que emplee nuestra plantilla ``"polls/index.html"``.

source: In previous parts of the tutorial, the templates have been provided with a context that contains the ``poll`` and ``latest_poll_list`` context variables. For DetailView the ``poll`` variable is provided automatically -- since we're using a Django model (``Poll``), Django is able to determine an appropriate name for the context variable. However, for ListView, the automatically generated context variable is ``poll_list``. To override this we provide the ``context_object_name`` option, specifying that we want to use ``latest_poll_list`` instead. As an alternative approach, you could change your templates to match the new default context variables -- but it's a lot easier to just tell Django to use the variable you want.
es: En partes previas del tutorial, las plantillas se han usado con un contexto que contiene las variables de contexto ``poll`` y ``latest_poll_list``. Para DetailView la variable ``poll`` se provee automáticamente -- dado que estamos usando un modelo de Django(``Poll``), Django es capaz de determinar un nombre apropiado para la variable de contexto. Sin embargo, para ListView, la variable de contexto generada automáticamente es ``poll_list``. Para derogar esto se provee la opción `context_object_name``, que especifica que queremos usar ``latest_poll_list`` en su lugar. Como una aproximación alternativa, puede cambiar sus plantillas para sincronizarse con sus nuevas variables de contexto predeterminadas -- Pero es mucho más sencillo decirle a Django que use la variable que usted quiere.

source: You can now delete the ``index()``, ``detail()`` and ``results()`` views from ``polls/views.py``. We don't need them anymore -- they have been replaced by generic views.
es: Puede borrar ahora las vistas ``index()``, ``detail()`` y ``results()`` de ``polls/views.py``. No las necesitamos más -- han sido reemplazadas por vistas genéricas.

source: The last thing to do is fix the URL handling to account for the use of generic views. In the vote view above, we used the :func:`~django.core.urlresolvers.reverse` function to avoid hard-coding our URLs. Now that we've switched to a generic view, we'll need to change the :func:`~django.core.urlresolvers.reverse` call to point back to our new generic view. We can't simply use the view function anymore -- generic views can be (and are) used multiple times -- but we can use the name we've given::
es: Lo último que resta por hacer es arreglar el manejo de URL para asegurar el uso de las vistas genéricas. En la vista de votación previamente habíamos usado la función :func:`~django.core.urlresolvers.reverse` para evitar quemar nuestras URLs. Ahora que hemos cambiado a vistas genéricas, necesitaremos cambiar la llamada a la función :func:`~django.core.urlresolvers.reverse` para referirse a la nueva vista genérica. Ya no podemos simplemente usar la función vista -- las vistas genéricas se pueden (y se usan) varias veces -- pero podemos usar el nombre que habíamos elegido::
