Repository: jerojasro/django-doc-es
Catalog: */po/tutorial04.po
Languages: es

source: Run the server, and use your new polling app based on generic views.
es: Ejecute el servidor, y use su nueva aplicación de votaciones basada en vistas genéricas.

source: For full details on generic views, see the :doc:`generic views documentation </topics/http/generic-views>`.
es: Puede encontrar detalles completos acerca de vistas genéricas en la :doc:`documentación de vistas genéricas </topics/http/generic-views>`.

source: Coming soon ===========
es: Pronto ======

source: The tutorial ends here for the time being. Future installments of the tutorial will cover:
es: El tutorial finaliza aquí por ahora. En el futuro cubrirá:

source: Advanced form processing
es: Procesamiento avanzado de formularios

source: Using the RSS framework
es: Uso del framework RSS

source: Using the cache framework
es: Uso del framework de caché

source: Using the comments framework
es: Uso del framework de comentarios

source: Advanced admin features: Permissions
es: Características avanzadas de la interfaz de administración: Permisos

source: Advanced admin features: Custom JavaScript
es: Características avanzadas de la interfaz de administración: Javascript a la medida

source: In the meantime, you might want to check out some pointers on :doc:`where to go from here </intro/whatsnext>`
es: Ahora podría darle una mirada a algunos enlaces en :doc:`dónde ir ahora </intro/whatsnext>`
